package week3.task3;

/**
 * Використовуючи рекурсію, виведіть на екран задане по порядковому номеру число Фібоначі.
 * Для вирішення завдання використовуйте шаблон:
 * Просимо врахувати деякі особливості перевірки завдань:
 * 1. Декларація package повинна залишатися незмінною (як у шаблоні),
 * зверніть на це увагу вставляючи Ваш код у вікно перевірки.
 * 2. Для перевірки використовуються (беруться до уваги) виключно методи з сигнатурою описаною в шаблоні.
 * 3. Кількість та зміст полів та/або методів відмінних від наведених в шаблоні не обмежена.
 * 4. В кожному класі повинен бути або конструктор за замовчанням або public безаргументний конструктор.
 */
public class Fibonacci {
    //Повертає число Фібоначчі за номером, нумерація почнеться з одиниці
    //якщо число не можливо вирахувати поверніть -1
    public long getNumber(int position) {
        if (position < 0) {
            return -1;
        } else {
            return fibonacci(position);
        }
    }

    private long fibonacci(int position) {
        if (position <= 1) {
            return position;
        }
        else {
            return fibonacci(position - 1) + fibonacci(position - 2);
        }
    }
}
